/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec-tillägg";
"06 06 02 82 06 01 0A 01"		= "Telesec-mekanism";

"06 07 02 82 06 01 0A 01 00"	= "Telesec-autentisering";
"06 08 02 82 06 01 0A 01 00 01"	= "Lösenordsautentisering";
"06 08 02 82 06 01 0A 01 00 02" = "Verifiering av skyddat lösenord";
"06 08 02 82 06 01 0A 01 00 03" = "Envägs X.509-autentisering";
"06 08 02 82 06 01 0A 01 00 04" = "Tvåvägs X.509-verifiering";
"06 08 02 82 06 01 0A 01 00 05" = "Trevägs X.509-verifiering";
"06 08 02 82 06 01 0A 01 00 06" = "Envägs ISO9798-autentisering";
"06 08 02 82 06 01 0A 01 00 07" = "Tvåvägs ISO9798-verifiering";
"06 08 02 82 06 01 0A 01 00 08" = "Telekomautentisering";

"06 07 02 82 06 01 0A 01 01"	= "Telesec-signatur";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 med RSA och ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 med RSA och Telesec-signaturstandard";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 med RSA och ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 med RSA och Telesec-signaturstandard";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 med RSA och Telekom-signaturstandard";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA-signatur";

"06 07 02 82 06 01 0A 01 02"	= "Telesec-kryptering";
"06 08 02 82 06 01 0A 01 02 00"	= "ingen";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA-telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Envägsfunktion";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash med Block Cipher";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC-funktion";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec-modul";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmer";
"06 07 02 82 06 01 0A 02 01"	= "Attributtyper";
"06 07 02 82 06 01 0A 02 02"	= "Certifikattyper";
"06 07 02 82 06 01 0A 02 03"	= "Meddelandetyper";
"06 07 02 82 06 01 0A 02 04"	= "PL-protokoll";
"06 07 02 82 06 01 0A 02 05"	= "SME och komponenter av SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Användbara definitioner";
"06 07 02 82 06 01 0A 02 08"	= "STE-filer";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Elektronisk beställning";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec TTP asymmetriskt program";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP grundläggande program";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP-meddelanden";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP-tidstämpelprogram";

"06 06 02 82 06 01 0A 03"		= "Objektklass";
"06 07 02 82 06 01 0A 03 00"	= "Telesec annat namn";
"06 07 02 82 06 01 0A 03 01"	= "Katalog";
"06 07 02 82 06 01 0A 03 02"	= "Katalogtyp";
"06 07 02 82 06 01 0A 03 03"	= "Kataloggrupp";
"06 07 02 82 06 01 0A 03 04"	= "Kataloganvändare";
"06 07 02 82 06 01 0A 03 05"	= "Symmetrisk nyckelpost";

"06 06 02 82 06 01 0A 04"		= "Paket";
"06 06 02 82 06 01 0A 05"		= "Parameter";
"06 06 02 82 06 01 0A 06"		= "Namnbindning";
"06 06 02 82 06 01 0A 07"		= "Attribut";
"06 07 02 82 06 01 0A 07 00"	= "Programgruppsidentifierare";
"06 07 02 82 06 01 0A 07 01"	= "Certifikattyp";
"06 07 02 82 06 01 0A 07 02"	= "Telesec-certifikat";
"06 07 02 82 06 01 0A 07 03"	= "Certifikatnummer";
"06 07 02 82 06 01 0A 07 04"	= "Certifikatåterkallningslista";
"06 07 02 82 06 01 0A 07 05"	= "Skapelsedatum";
"06 07 02 82 06 01 0A 07 06"	= "Utfärdare";
"06 07 02 82 06 01 0A 07 07"	= "Namngivare";
"06 07 02 82 06 01 0A 07 08"	= "Publik nyckelkatalog";
"06 07 02 82 06 01 0A 07 09"	= "Säkerhetsdomän";
"06 07 02 82 06 01 0A 07 0A"	= "Ämne";
"06 07 02 82 06 01 0A 07 0B"	= "Återkallelsetid";
"06 07 02 82 06 01 0A 07 0C"	= "Användargruppreferens";
"06 07 02 82 06 01 0A 07 0D"	= "Giltighet";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Säkerhetsmeddelandemiljö";
"06 07 02 82 06 01 0A 07 10"	= "Anonymiserad publik nyckelkatalog";
"06 07 02 82 06 01 0A 07 11"	= "Telesec-förnamn";
"06 07 02 82 06 01 0A 07 12"	= "Namntillägg";
"06 07 02 82 06 01 0A 07 13"	= "Telesec-postnummer";
"06 07 02 82 06 01 0A 07 14"	= "Namnsärskiljare";
"06 07 02 82 06 01 0A 07 15"	= "Telesec-certifikatlista";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust-certifikatlista";
"06 07 02 82 06 01 0A 07 17"	= "X.509-certifikatlista";
"06 07 02 82 06 01 0A 07 18"	= "Utgivningstid";
"06 07 02 82 06 01 0A 07 19"	= "Fysiskt kortnummer";
"06 07 02 82 06 01 0A 07 1A"	= "Filtyp";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl-fil är arkiv";
"06 07 02 82 06 01 0A 07 1C"	= "E-postadress";
"06 07 02 82 06 01 0A 07 1D"	= "Certifikatmallista";
"06 07 02 82 06 01 0A 07 1E"	= "Katalognamn";
"06 07 02 82 06 01 0A 07 1F"	= "Katalogtypnamn";
"06 07 02 82 06 01 0A 07 20"	= "Kataloggruppnamn";
"06 07 02 82 06 01 0A 07 21"	= "Kataloganvändarnamn";
"06 07 02 82 06 01 0A 07 22"	= "Återkallningsflagga";
"06 07 02 82 06 01 0A 07 23"	= "Namn på symmetrisk nyckelpost";
"06 07 02 82 06 01 0A 07 24"	= "GL-nummer";
"06 07 02 82 06 01 0A 07 25"	= "GO-nummer";
"06 07 02 82 06 01 0A 07 26"	= "G-tangentdata";
"06 07 02 82 06 01 0A 07 27"	= "Z-tangentdata";
"06 07 02 82 06 01 0A 07 28"	= "KT-tangentdata";
"06 07 02 82 06 01 0A 07 2A"	= "KT-tangentnummer";
"06 07 02 82 06 01 0A 07 33"	= "Skapande av återkallelsetid";
"06 07 02 82 06 01 0A 07 34"	= "Ansvarstext";

"06 06 02 82 06 01 0A 08"		= "Attributgrupp";
"06 06 02 82 06 01 0A 09"		= "Åtgärd";
"06 06 02 82 06 01 0A 0A"		= "Notis";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Säkerhetsprogram";

"06 06 02 82 06 01 0A 0C"		= "Tilläggsdefinitioner för Cert och CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Certifikattillägg Ansvarsbegränsningstillägg";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec-certifikat ID-tillägg";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec-policyidentifierare";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec-policykvalificerar-ID";
"06 07 02 82 06 01 0A 0C 04"	= "Telesec-CRL-filtrerat tillägg";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec-CRL-filtertillägg";
"06 07 02 82 06 01 0A 0C 06"	= "Telesec-namngivartillägg";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "Användar-ID";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822-brevlåda";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Domänkomponent";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Australiskt affärsnummer";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Australisk certifikatpolicyidentifierare";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet personligt";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet företag";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet rättsligt";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet-policyidentifierare";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Symmetrisk krypteringsalgoritm";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS-policyidentifierare med hög säkerhet";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK-policyidentifierare";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT-personidentifierare";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57-modul";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1-certifikathantering";
"06 06 2A 86 48 CE 38 02"		= "Blockera instruktion";
"06 07 2A 86 48 CE 38 02 01"	= "Blockera instruktion - Ingen";
"06 07 2A 86 48 CE 38 02 02"	= "Anropsutfärdare";
"06 07 2A 86 48 CE 38 02 03"	= "Avböj";
"06 07 2A 86 48 CE 38 02 04"	= "Hämta kännetecken";
"06 06 2A 86 48 CE 38 03"		= "Attribut";
"06 06 2A 86 48 CE 38 03 01"	= "Motsignering";
"06 06 2A 86 48 CE 38 03 02"	= "Attributcertifikat";
"06 06 2A 86 48 CE 38 04"		= "Algoritm";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA-matchning";
"06 07 2A 86 48 CE 38 04 03"	= "DSA med SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62-fälttyp";
"06 07 2A 86 48 CE 3D 01 01"	= "Primärfält";
"06 07 2A 86 48 CE 3D 01 02"	= "Karakteristik - två-fält";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Karakteristik - två-bas";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Nullbas";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Trinomialbas";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Pentanomialbas";
"06 06 2A 86 48 CE 3D 02"		= "Publik nyckeltyp";
"06 07 2A 86 48 CE 3D 02 01"	= "Publik nyckel med elliptisk kurva";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42-fälttyp";
"06 07 2A 86 48 CE 3E 01 01"	= "Galoisfältsprimtal";
"06 06 2A 86 48 CE 3E 02"		= "Nummertyp";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman publik nyckel";
"06 06 2A 86 48 CE 3E 03"		= "Schema";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman statisk";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman efemär";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman hybrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman hybrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Anförtro versionsinfo";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE med MD5 och CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "Lösenordsbaserad MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Anförtro användare";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Anförtro CA-info";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Attributcertifikat";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP-kryptering (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Angiven RSA-OAEP-etikett";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS-signaturschema";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 med RSA-kryptering";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 med RSA-kryptering";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA-kryptering";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman överenskommelse om nyckel";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE med MD2 och DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE med MD5 och DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE med MD2 och RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE med MD5 och RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE med MD5 och XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE med SHA och DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Data";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Signerade data";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Kuverterade data";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Signerade och kuverterade data";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Sammanfattade data";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Krypterade data";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Data med attribut";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Krypterad infomation om privat nyckel";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "E-postadress";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Ostrukturerat namn";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Innehållstyp";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Sammanfattning av meddelande";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Signeringstid";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Motsignering";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Testa lösenord";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Ostrukturerad adress";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Utökade certifikatattribut";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Utgivare och serienummer";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Lösenordskontroll";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Publik nyckel";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Signerar beskrivning";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Tilläggsbegäran";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME-förmågor";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Föredra signerade data";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Kan inte avkryptera något";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Begäran om kvitto";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Kvitto";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Innehållstips";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Expansionshistoria för e-postlista";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME-moduler";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Kryptografisk meddelandesyntax";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Förbättrade säkerhetstjänster";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME-objektidentifierare";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3-meddelande";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS elektronisk signatur 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS elektronisk signatur 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS elektronisk signaturpolicy 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS elektronisk signaturpolicy 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME-innehållstyper";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "S/MIME-verifierade attribut";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME-algoritmer";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME-certifikatutdelning";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "LDAP-certifikatutdelning";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME-signaturpolicykvalificerare";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME-signaturtypidentifierare";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Upphovsmanssignatur";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Domänsignatur";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Signatur för ytterligare attribut";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Granska signatur";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME-förmågor";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Föredra binär insida";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Eget namn (för PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Lokalt nyckel-ID (för PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Certifikattyper (för PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509-certifikat (för PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI-certifikat (för PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL-typer (för PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509-lista över återkallade certifikat (för PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 Personliga uppgifter utbytessyntax";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 lösenordsbaserade krypterings-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE med SHA-1 och 128-bitars RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE med SHA-1 och 40-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE med SHA-1 och trenyckels Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE med SHA-1 och tvånyckels Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE med SHA-1 och 128-bitars RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE med SHA-1 och 40 bitars RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 dold nyckel";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12-väsk-ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "ID för PKCS-12-nyckelväska";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "ID för PKCS-12-certifikat och CRL-väska";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "ID för PKCS-12 hemlig väska";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "ID för PKCS-12 säkert innehåll";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "ID för PKCS-12 PKCS-8-väska för dold nyckel";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "ID för PKCS-12-certifikatväska";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "ID för PKCS-12 X.509-certifikat och CRL-väska";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "ID för PKCS-12 SDSI-certifikatväska";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 lösenordsbaserat krypterings-ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE med SHA-1 och 128-bitars RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE med SHA-1 och 40-bitars RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE med SHA-1 och Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE med SHA-1 och 128-bitars RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE med SHA-1 och 40-bitars RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE med SHA-1 och RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE med SHA-1 och RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12-kuverterings-ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 RSA-kryptering med 128-bitars RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 RSA-kryptering med 40-bitars RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 RSA-kryptering med Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12-signatur-ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "PKCS-12 RSA-signatur med SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 version 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12-väsk-ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12-nyckelväska";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8-väska för dold nyckel";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12-certifikatväska";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12-väska för lista över återkallade certifikat";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 hemlig väska";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Väska för PKCS-12 säkert innehåll";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15-moduler";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15-attribut";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15-innehållstyp";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15-innehåll";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI Digest-algoritm";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC med SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI-krypteringsalgoritm";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 med MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus okänd policyidentifierare";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT användare-till-användare Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server-objektklass";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Platsadressering";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Klass-schema";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Attributschema";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Brevlådeagent";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Brevlåda";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Behållare";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Postmottagare";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Leveransmekanism";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft-filformat";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "SPC-kontext indirekta data";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC-utgivarinfo";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC-redogörelsetyp";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC-information";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC-certifikattillägg";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE-bilddata";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC-länk (typ 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Individuell kodsignering";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Kommersiell kodsignering";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC-länk (typ 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC-minimikriterier";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "SPC finansiella kriterier";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC-länk (typ 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Leverantör av NTLM-säkerhetsstöd";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Tidstämpelsmotsignatur";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Lista över betrodda certifikat";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Sorterat CTL-tillägg";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Nästa uppdateringsplats";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Förbättrad nyckelanvändning";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Signering av lista över betrodda certifikat";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Tidstämpelssignering";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Kryptografi för serverportar";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Serialiserad kryptering";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Krypterade filsystem";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Återställning av krypterade filsystem";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Maskinvara kompatibel med Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5-signering";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "OEM-signering av Windows-maskinvara";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Inbäddad NT-signering";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Betrodd rotlistsignering";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Kvalificerat underordnande";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Nyckelåterställning";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Dokumentsignering";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Attributobjektidentifierare";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Ja/Nej pålitlighetsattribut";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM-individualisering";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft-licenser";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft-licensserver";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10-objektidentifierare";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Förnyelsecertifikat";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Namn/värde-par för anmälan";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP för anmälan";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS-version";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12-attribut";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Lokal datornyckeluppsättning";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft Enrollment-infrastruktur";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Registrera CTL-användning automatiskt";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Typ av registreringscertifikat";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Registreringsagent";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Smartkortsinloggning";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "NT-huvudnamn";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft Certificate Server-infrastruktur";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA förnyad version";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM-version";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM-attribut";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Dokumentnamn";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Dokumentbeskrivning";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Krypterade data";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Krypterat innehåll";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT-policyidentifierare";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL-policyidentifierare";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA-policyidentifierare";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal med SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal med RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib-attribut";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib-närvarokontroll";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP-respons RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Utökad OCSP-respons RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Orsak till utökad lista över återkallade certifikat";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Nyckelfunktioner";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib-innehåll";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib-konfigureringsdata";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib-användarindex";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib-användarinfo";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY-policyidentifierare";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Tidsäker";
"06 08 2B 06 01 04 01 AA 60 01"		= "Tidsignatursystem";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Tidsignatursystem 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Tidsignatursystem 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Tidsignatursystem 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Sekundära praxis";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Läkaridentifierare";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos autentiseringsdata";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos Diffie-Hellman nyckeldata";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos Reply-nyckeldata";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos-klientautentisering";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos KDC (Key Distribution Center)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "SPKM (Simple Public Key Mechanism)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Publik nyckelinfrastruktur";

"06 07 2B 06 01 05 05 07 01"		= "PKIX privatcertifikattillägg";
"06 08 2B 06 01 05 05 07 01 01"		= "Certifikatutfärdare - informationsåtkomst";
"06 08 2B 06 01 05 05 07 01 02"		= "Biometrisk information";
"06 08 2B 06 01 05 05 07 01 03"		= "Kvalificerade certifikatsatser";
"06 08 2B 06 01 05 05 07 01 04"		= "Revisionsidentitet för attributcertifikat";
"06 08 2B 06 01 05 05 07 01 05"		= "Attributcertifikatinriktning";
"06 08 2B 06 01 05 05 07 01 06"		= "Auktoritetskontroller för attributcertifikat";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP IP-adressblockering";
"06 08 2B 06 01 05 05 07 01 08"		= "Autonom SBGP-systemidentifierare";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP-routeridentifierare";
"06 08 2B 06 01 05 05 07 01 0A"		= "Attributcertifikatproxning";
"06 08 2B 06 01 05 05 07 01 0B"		= "Åtkomst till ämnesinformation";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotyp";

"06 07 2B 06 01 05 05 07 02"		= "Policykvalificerartyper";
"06 08 2B 06 01 05 05 07 02 01"		= "Redogörelse för certifieringspraxis";
"06 08 2B 06 01 05 05 07 02 02"		= "Användarmeddelande";
"06 08 2B 06 01 05 05 07 02 03"		= "Textanteckning";

"06 07 2B 06 01 05 05 07 03"		= "Nyckelsyfte";
"06 08 2B 06 01 05 05 07 03 01"		= "Serverautentisering";
"06 08 2B 06 01 05 05 07 03 02"		= "Klientautentisering";
"06 08 2B 06 01 05 05 07 03 03"		= "Kodsignering";
"06 08 2B 06 01 05 05 07 03 04"		= "E-postskydd";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC-slutsystem";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC-tunnel";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC-användare";
"06 08 2B 06 01 05 05 07 03 08"		= "Tidstämpling";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP-signering";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA-serverautentisering";

"06 07 2B 06 01 05 05 07 04"		= "CMP-informationstyper";
"06 08 2B 06 01 05 05 07 04 01"		= "Krypteringscertifikat för CA-protokoll";
"06 08 2B 06 01 05 05 07 04 02"		= "Signerar nyckelpartyper";
"06 08 2B 06 01 05 05 07 04 03"		= "Krypteringsnyckelpartyper";
"06 08 2B 06 01 05 05 07 04 04"		= "Föredragen symmetrisk algoritm";
"06 08 2B 06 01 05 05 07 04 05"		= "Information om CA-nyckeluppdatering";
"06 08 2B 06 01 05 05 07 04 06"		= "Aktuell CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "OID som inte stöds";
"06 08 2B 06 01 05 05 07 04 08"		= "Abonnemangsbeställning";
"06 08 2B 06 01 05 05 07 04 09"		= "Abonnemangssvar";
"06 08 2B 06 01 05 05 07 04 0A"		= "Begäran om nyckelparparametrar";
"06 08 2B 06 01 05 05 07 04 0B"		= "Svar på nyckelparparametrar";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF-registrering";
"06 08 2B 06 01 05 05 07 05 01"		= "Registreringskontroll";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Registreringsbevis";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Autentiserare";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI-publiceringsinfo";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI-arkivalternativ";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Gammalt certifikat-ID";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Protokollkrypteringsnyckel";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Alternativ certifikatmall";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS-mall";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF-registreringsinformation";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8-par";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Certifikatbegäran";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmer";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Ingen signatur";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC-reglage";

"06 07 2B 06 01 05 05 07 08"		= "Andra namn";
"06 08 2B 06 01 05 05 07 08 01"		= "Personuppgifter";
"06 08 2B 06 01 05 05 07 08 02"		= "Användargrupp";

"06 07 2B 06 01 05 05 07 09"		= "Personuppgifter";
"06 08 2B 06 01 05 05 07 09 01"		= "Födelsedatum";
"06 08 2B 06 01 05 05 07 09 02"		= "Födelseplats";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonym";
"06 08 2B 06 01 05 05 07 09 04"		= "Kön";
"06 08 2B 06 01 05 05 07 09 05"		= "Medborgarskap";
"06 08 2B 06 01 05 05 07 09 06"		= "Uppehållsland";

"06 07 2B 06 01 05 05 07 0A"		= "Attributcertifikat";
"06 08 2B 06 01 05 05 07 0A 01"		= "Autentiseringsinformation";
"06 08 2B 06 01 05 05 07 0A 02"		= "Åtkomstidentitet";
"06 08 2B 06 01 05 05 07 0A 03"		= "Debiteringsidentitet";
"06 08 2B 06 01 05 05 07 0A 04"		= "Grupp";
"06 08 2B 06 01 05 05 07 0A 05"		= "Roll";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Statusprotokoll för online-certifikat";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP-grundläggande svar";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP tillfälligt tillägg";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL-referens";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP-respons";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP ingen återkallandekontroll";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP-arkivavslutning";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP Service Locator";

"06 08 2B 06 01 05 05 07 30 02"		= "CA-utfärdare";
"06 08 2B 06 01 05 05 07 30 03"		= "Tidstämpling";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE Intermediate";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC-krypteringsalgoritm";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC-hashalgoritm";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC-signaturalgoritm";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 med RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 med RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 med RSA";
"06 05 2B 0E 03 02 03"				= "MD5 med RSA";
"06 05 2B 0E 03 02 04"				= "MD4 med RSA-kryptering";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N med RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA-signatur";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA med SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 med RSA-signatur";
"06 05 2B 0E 03 02 0F"				= "SHA med RSA-signatur";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman med Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Common";
"06 05 2B 0E 03 02 15"				= "DSA Common med SHA";
"06 05 2B 0E 03 02 16"				= "RSA-nyckeltransport";
"06 05 2B 0E 03 02 17"				= "Hashkod med nyckel";
"06 05 2B 0E 03 02 18"				= "MD2 med RSA-signatur";
"06 05 2B 0E 03 02 19"				= "MD5 med RSA-signature";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA med SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA med Common SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 med RSA-kryptering";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mekanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 med RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 med ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Dokument";
"06 04 2B 24 01 01"					= "Slutgiltig version";
"06 04 2B 24 01 02"					= "Utkast";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritm";
"06 04 2B 24 03 01"					= "Krypteringsalgoritm";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA-kryptering";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Hashalgoritm";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 enkel längd";
"06 05 2B 24 03 02 05"				= "MDC2 dubbel längd";
"06 04 2B 24 03 03"					= "Signaturalgoritm";
"06 05 2B 24 03 03 01"				= "RSA-signatur";

"06 06 2B 24 03 03 01 01"			= "RSA-signatur med SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "RSA-signatur med SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "RSA-signatur med SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "RSA-signatur med SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "RSA-signatur med SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "RSA-signatur med SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "RSA-signature med SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "RSA-signatur med SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "RSA-signatur med SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "RSA-signatur med SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "RSA-signatur med SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "RSA-signatur med SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "RSA-signatur med SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "RSA-signatur med SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "RSA-signatur med SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "RSA-signatur med SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "RSA-signatur med SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "RSA-signatur med SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "RSA-signatur med SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "RSA-signatur med SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "RSA-signatur med SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "RSA-signatur med SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "RSA-signatur med SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "RSA-signatur med SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "RSA-signatur med SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "RSA-signatur med SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "RSA-signatur med RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "RSA-signatur med RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "RSA-signatur med RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "RSA-signatur med RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "RSA-signatur med RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "RSA-signatur med RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "RSA-signatur med RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "RSA-signatur med RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "RSA-signatur med RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "RSA-signatur med RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "RSA-signatur med RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "RSA-signatur med RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "RSA-signatur med RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RSA-signatur med RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RSA-signatur med RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "RSA-signatur med RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "RSA-signatur med RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "RSA-signatur med RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "RSA-signatur med RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "RSA-signatur med RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "RSA-signatur med RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "RSA-signatur med RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "RSA-signatur med RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "RSA-signatur med RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "RSA-signatur med RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "RSA-signatur med RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "RSA-signatur med RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "RSA-signatur med RIPEMD-256";

"06 05 2B 24 03 03 02"				= "ECSIE-signatur";
"06 06 2B 24 03 03 02 01"			= "ECSIE-signatur med SHA-1";
"06 06 2B 24 03 03 02 02"			= "ECSIE-signatur med RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "ECSIE-signatur med MD2";
"06 06 2B 24 03 03 02 04"			= "ECSIE-signatur med MD5";

"06 04 2B 24 03 04"					= "Signaturschema";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 med RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 med RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 med RND";

"06 03 2B 24 04"					= "Attribut";
"06 03 2B 24 05"					= "Policy";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "Tillverkarspecifik API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "Funktionalitetsspecifik API";
"06 03 2B 24 07"					= "Nyckelhantering";
"06 04 2B 24 07 01"					= "Nyckelavtal";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Nyckelöverföring";
"06 05 2B 24 07 02 01"				= "ISO9796-2 med RSA-kryptering";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform-policyidentifierare";
"06 05 2B 24 08 02 01"				= "Katalogtjänst";

"06 05 2B 24 08 03 01"				= "Datum för certifikatframställning";
"06 05 2B 24 08 03 02"				= "Anskaffning";
"06 05 2B 24 08 03 03"				= "Tillträde";
"06 05 2B 24 08 03 04"				= "Monetär gräns";
"06 05 2B 24 08 03 05"				= "Majoritetsförklaring";
"06 05 2B 24 08 03 06"				= "Integrerat kretskortsserienummer";
"06 05 2B 24 08 03 07"				= "Publik nyckelreferens";
"06 05 2B 24 08 03 08"				= "Begränsning";
"06 05 2B 24 08 03 09"				= "Hämta om tillåtet";
"06 05 2B 24 08 03 0A"				= "Begärt certifikat";
"06 05 2B 24 08 03 0B"				= "Namngivare";
"06 05 2B 24 08 03 0C"				= "Certifikat i katalog sedan";
"06 05 2B 24 08 03 0D"				= "Hashcertifikat";

"06 05 2B 24 08 04 01"				= "Personuppgifter";
"06 05 2B 24 08 04 08"				= "Begränsning";
"06 07 2B 24 08 05 01 01 01"		= "RSA visar SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA visar RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA med SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA med RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA utökad";
"06 07 2B 24 08 05 01 02 02"		= "DSA med RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certifikat";
"06 05 2B 24 08 06 02"				= "Certifikatreferens";
"06 05 2B 24 08 06 03"				= "Attributcertifikat";
"06 05 2B 24 08 06 04"				= "Attributreferens";
"06 05 2B 24 08 06 05"				= "Filnamn";
"06 05 2B 24 08 06 06"				= "Lagringstid";
"06 05 2B 24 08 06 07"				= "Filstorlek";
"06 05 2B 24 08 06 08"				= "Plats";
"06 05 2B 24 08 06 09"				= "Signaturnummer";
"06 05 2B 24 08 06 0A"				= "Självgenererad";

"06 05 2B 24 08 07 01"				= "Teletrust-presentationstyper";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binärt";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "PostScript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Text";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte-certifikattillägg";
"06 05 2B 65 01 04 01"				= "Starkt Extranet";

/* X.520 */

"06 02 55 04"		= "X.520-attributtyper";
"06 03 55 04 00"	= "Objektklass";
"06 03 55 04 01"	= "Postnamnsalias";
"06 03 55 04 02"	= "Kunskapsinformation";
"06 03 55 04 03"	= "Gemensamt namn";
"06 03 55 04 04"	= "Efternamn";
"06 03 55 04 05"	= "Serienummer";
"06 03 55 04 06"	= "Landsnamn";
"06 03 55 04 07"	= "Lokalitets namn";
"06 04 55 04 07 01"	= "Kollektivt ortsnamn";
"06 03 55 04 08"	= "Delstats- eller regionnamn";
"06 04 55 04 08 01"	= "Kollektivt delstats- eller regionnamn";
"06 03 55 04 09"	= "Gatuadress";
"06 04 55 04 09 01"	= "Kollektiv gatuadress";
"06 03 55 04 0A"	= "Organisationsnamn";
"06 04 55 04 0A 01"	= "Kollektivt organisationsnamn";
"06 03 55 04 0B"	= "Organisationsenhetsnamn";
"06 04 55 04 0B 01"	= "Kollektivt organisationsenhetsnamn";
"06 03 55 04 0C"	= "Titel";
"06 03 55 04 0D"	= "Beskrivning";
"06 03 55 04 0E"	= "Sökguide";
"06 03 55 04 0F"	= "Branschkategori";
"06 03 55 04 10"	= "Postadress";
"06 04 55 04 10 01"	= "Kollektiv postadress";
"06 03 55 04 11"	= "Postnummer";
"06 04 55 04 11 01"	= "Kollektivt postnummer";
"06 03 55 04 12"	= "Postbox";
"06 04 55 04 12 01"	= "Kollektiv postbox";
"06 03 55 04 13"	= "Namn på fysiskt leveranskontor";
"06 04 55 04 13 01"	= "Namn på kollektivt fysiskt leveranskontor";
"06 03 55 04 14"	= "Telefonnummer";
"06 04 55 04 14 01"	= "Kollektivt telefonnummer";
"06 03 55 04 15"	= "Telexnummer";
"06 04 55 04 15 01"	= "Kollektivt telexnummer";
"06 03 55 04 16"	= "Teletex-terminalidentifierare";
"06 04 55 04 16 01"	= "Kollektiv teletex-terminalidentifierare";
"06 03 55 04 17"	= "Telefaxnummer";
"06 04 55 04 17 01"	= "Kollektivt faxtelefonnummer";
"06 03 55 04 18"	= "X.121-adress";
"06 03 55 04 19"	= "Internationellt ISDN-nummer";
"06 04 55 04 19 01"	= "Kollektivt internationellt ISDN-nummer";
"06 03 55 04 1A"	= "Registrerad adress";
"06 03 55 04 1B"	= "Destinationsindikator";
"06 03 55 04 1C"	= "Föredragen leveransmetod";
"06 03 55 04 1D"	= "Presentationsadress";
"06 03 55 04 1E"	= "Stödd programkontext";
"06 03 55 04 1F"	= "Medlem";
"06 03 55 04 20"	= "Ägare";
"06 03 55 04 21"	= "Rollinnehavare";
"06 03 55 04 22"	= "Se även";
"06 03 55 04 23"	= "Användarlösenord";
"06 03 55 04 24"	= "Användarcertifikat";
"06 03 55 04 25"	= "Certifikatutfärdarcertifikat";
"06 03 55 04 26"	= "Återkallningslista för auktoritet";
"06 03 55 04 27"	= "Certifikatåterkallningslista";
"06 03 55 04 28"	= "Korscertifikatpar";
"06 03 55 04 29"	= "Namn";
"06 03 55 04 2A"	= "Förnamn";
"06 03 55 04 2B"	= "Initialer";
"06 03 55 04 2C"	= "Junior/senior";
"06 03 55 04 2D"	= "Unikt identifieringsmärke";
"06 03 55 04 2E"	= "DN-kvalificerare";
"06 03 55 04 2F"	= "Förbättrad sökguide";
"06 03 55 04 30"	= "Protokollinformation";
"06 03 55 04 31"	= "Distingerat namn";
"06 03 55 04 32"	= "Unik medlem";
"06 03 55 04 33"	= "Husidentifierare";
"06 03 55 04 34"	= "Algoritmer som stöds";
"06 03 55 04 35"	= "Delta-återkallningslista";
"06 03 55 04 36"	= "Godkännande";
"06 03 55 04 3A"	= "Korscertifikatpar";

/* X.500 object classes */

"06 02 55 06"		= "X.520-objektklass";
"06 03 55 06 00"	= "Högst upp";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Land";
"06 03 55 06 03"	= "Lokalitet";
"06 03 55 06 04"	= "Organisation";
"06 03 55 06 05"	= "Organisationsenhet";
"06 03 55 06 06"	= "Person";
"06 03 55 06 07"	= "Organisationsperson";
"06 03 55 06 08"	= "Organisationsroll";
"06 03 55 06 09"	= "Namngrupp";
"06 03 55 06 0A"	= "Bostadsperson";
"06 03 55 06 0B"	= "Programprocess";
"06 03 55 06 0C"	= "Programentitet";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Enhet";
"06 03 55 06 0F"	= "Användare med stark autentisering";
"06 03 55 06 10"	= "Certifikatauktoritet";
"06 03 55 06 11"	= "Grupp med unika namn";
"06 03 55 06 15"	= "PKI-användare";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "X.500-algoritmer";
"06 03 55 08 01"	= "X.500-krypteringsalgoritmer";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509-certifikattillägg";
"06 03 55 1D 01"	= "Identifierare till behörighetsnyckel (gammal)";
"06 03 55 1D 02"	= "Primära nyckelattribut (gamla)";
"06 03 55 1D 03"	= "Certifikatpolicyer (gamla)";
"06 03 55 1D 04"	= "Begränsning av nyckelanvändning (gammal)";
"06 03 55 1D 05"	= "Policykartläggning (gammal)";
"06 03 55 1D 06"	= "Begränsningar hos underträd";
"06 03 55 1D 07"	= "Alternativt ämnesnamn (gammalt)";
"06 03 55 1D 08"	= "Alternativt utfärdarnamn (gammalt)";
"06 03 55 1D 09"	= "Attribut för ämneskatalog";
"06 03 55 1D 0A"	= "Grundläggande restriktioner (gammal 2.5.29.10)";
"06 03 55 1D 0B"	= "Namnbegränsningar (gamla)";
"06 03 55 1D 0C"	= "Policybegränsningar (gamla)";
"06 03 55 1D 0D"	= "Grundläggande restriktioner (gammal 2.5.29.13)";
"06 03 55 1D 0E"	= "Ämnesnyckel-ID";
"06 03 55 1D 0F"	= "Nyckelanvändning";
"06 03 55 1D 10"	= "Användningsperiod för privat nyckel";
"06 03 55 1D 11"	= "Alternativt ämnesnamn";
"06 03 55 1D 12"	= "Alternativt utfärdarnamn";
"06 03 55 1D 13"	= "Grundläggande restriktioner";
"06 03 55 1D 14"	= "Nummber för certifikatåterkallningslista";
"06 03 55 1D 15"	= "Orsakskod för lista över återkallade certifikat";
"06 03 55 1D 16"	= "Sista giltighetsdag (gammal)";
"06 03 55 1D 17"	= "Kod för Blockera instruktion";
"06 03 55 1D 18"	= "Ogiltighetsdatum";
"06 03 55 1D 19"	= "Distributionspunkter för lista över återkallade certifikat (CRL - gamla)";
"06 03 55 1D 1A"	= "Distributionspunkt för utgivning (gammal)";
"06 03 55 1D 1B"	= "Indikator för lista över ändringar i återkallade certifikat";
"06 03 55 1D 1C"	= "Distributionspunkt för utgivning";
"06 03 55 1D 1D"	= "Certifikatutfärdare";
"06 03 55 1D 1E"	= "Namnbegränsningar";
"06 03 55 1D 1F"	= "Distributionspunkter för lista över återkallade certifikat (CRL)";
"06 03 55 1D 20"	= "Certifikatpolicyer";
"06 04 55 1D 20 00"	= "Alla policyidentifierare";
"06 03 55 1D 21"	= "Policykartläggningar";
"06 03 55 1D 22"	= "Policybegränsningar";
"06 03 55 1D 23"	= "Identifierare till behörighetsnyckel";
"06 03 55 1D 24"	= "Policybegränsningar";
"06 03 55 1D 25"	= "Utökad nyckelanvändning";
"06 04 55 1D 25 00"	= "Alla utökade nyckelanvändningar";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS-signaturalgoritm";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza-signaturalgoritm";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS-konfidentialitetsalgoritm";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza konfidentialitetsalgoritm";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS-integritetsalgoritm";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza integritetsalgoritm";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS-bevisskyddsalgoritm";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza bevisskyddsalgoritm";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS-nyckelhanteringsalgoritm";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza nyckelhanteringsalgoritm";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS-nyckelhanterings- och signaturalgoritm";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza nyckelhanterings- och signaturalgoritm";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A signaturalgoritm";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A konfidentialitetsalgoritm";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A integritetsalgoritm";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A bevisskyddsalgoritm";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A nyckelhanteringsalgoritm";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A nyckelhanterings- och signaturalgoritm";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza uppdaterad signaturalgoritm";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza nyckelhantering och uppdaterade signaturalgoritmer";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza uppdaterad integritetsalgoritm";
"06 09 60 86 48 01 65 02 01 01 16"	= "Nyckelutbytesalgoritm";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80-algoritm";
"06 09 60 86 48 01 65 02 01 01 18"	= "Nyckelkrypteringsalgoritm (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822-meddelandeformat";
"06 09 60 86 48 01 65 02 01 02 02"	= "Tomt innehåll";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP-innehållstyp";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3-innehållstyp";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP-innehållstyp";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey Agent Protocol";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1-innehållstyp";
"06 09 60 86 48 01 65 02 01 02 48"	= "Vidarebefordrad MSP-del av meddelandekropp";
"06 09 60 86 48 01 65 02 01 02 49"	= "MSP-parametrar för vidarebefordrat meddelande";
"06 09 60 86 48 01 65 02 01 02 50"	= "Vidarebefordrad CSP-del av meddelandekropp";
"06 09 60 86 48 01 65 02 01 02 51"	= "CSP-parametrar för vidarebefordrat meddelande";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS-säkerhetspolicy";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Säkerhetspolicy";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Allmän";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Förvald säkerhetspolicy";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS-nyckelhanteringscertifikat";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS-användarsignaturcertifikat";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS-nyckelhanterings- och signaturcertifikat";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza nyckelhanteringscertifikat";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza nyckelhanterings- och signaturcertifikat";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza användarsignaturcertifikat";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza CA-signaturcertifikat";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS CA-signaturcertifikat";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Hjälpvektor";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Kvittopolicy";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Medlemskap";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administratörer";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKM";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKM";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKM";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKM";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKM";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKM";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKM";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKM";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKM";
"06 09 60 86 48 01 65 02 01 05 1D"	= "oktUKM";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKM";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKM";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta-SDNS-signatur CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS-signatur CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Återkallningslista för SDNS-certifikat";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Återkallningslista för Fortezza-certifikat";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Undantagen adressprocessor";
"06 09 60 86 48 01 65 02 01 05 30"	= "Vakt";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algoritmer som stöds";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A nyckelhanteringscertifikat";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A nyckelhanterings- och signaturcertifikat";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A användarsignaturcertifikat";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC-info";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC CA-restriktioner";
"06 09 60 86 48 01 65 02 01 05 37"	= "Signatur- eller nyckelhanteringsbehörigheter";
"06 09 60 86 48 01 65 02 01 05 38"	= "Allmänna behörigheter";
"06 09 60 86 48 01 65 02 01 05 39"	= "Märkt attribut";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Policyinformationsfil";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Sec Policy-informationsfil";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA-spelrumsrestriktion";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP-tillägg";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI-säkerhetskategorier";
"06 09 60 86 48 01 65 02 01 08 02"		= "Standardmässiga säkerhetsmärkningsbehörigheter";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Signaturbehörigheter";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Nyckelhanteringsbehörigheter";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Behörighet för namngiven etikettsuppsättning";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "USA:s försvarsdepartement klass 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "USA:s försvarsdepartement klass 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "USA:s försvarsdepartement klass 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "USA:s försvarsdepartement klass 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "USA:s försvarsdepartement PKI-klass 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Testsäkerhetspolicy";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1-säkerhetskategorier";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1-etikettuppsättning Noll";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1-etikettuppsättning Ett";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1-etikettuppsättning Två";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2-säkerhetskategorier";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2-etikettuppsättning Noll";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2-etikettuppsättning Ett";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2-etikettuppsättning Två";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka-säkerhetskategorier";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka-etikettsuppsättningsnamn 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka-etikettsuppsättningsnamn 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka-etikettsuppsättningsnamn 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Testpost i lista över återkallade certifikat";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Märkning";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK-policyidentifierare";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA rudimentär policyidentifierare";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA grundläggande policyidentifierare";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA medel policyidentifierare";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA hög policyidentifierare";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA-nyckel";
"06 08 60 86 48 01 65 03 02 03"			= "Tillägg";
"06 09 60 86 48 01 65 03 02 03 01"		= "Nyckelåterställningsteknik";
"06 09 60 86 48 01 65 03 02 03 02"		= "Nyckelåterställning möjlig";
"06 09 60 86 48 01 65 03 02 03 03"		= "Nyckelåterställning";
"06 08 60 86 48 01 65 03 02 04"			= "Nyckelåterställningsscheman";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK-tillägg";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST-algoritm";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell-algoritm";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 med RSA-kryptering BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 med RSA-kryptering BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 med RSA-kryptering BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM-sammandrag";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC med SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC med MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4-paket";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA-kryptering BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW-lösenord";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI-attributtyp";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Säkerhetsattribut";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Pålitlighetsgräns";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape-objektidentifierare";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape-certifikattillägg";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape-certifikattyp";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Bas-URL för Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL till Netscape-återkallelse";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL till Netscape-ceritifkatutfärdaråterkallelse";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Nedläsnings-URL till Netscapes lista över återkallade certifikat";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Nedläsnings-URL till Netscapes certifikatutfärdarcertifikat";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL till Netscapes certifikatförnyelse";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL till Netscape-ceritifkatutfärdarpolicy";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL till Netscapes certifikathemsida";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logotyp för Netscape-certifikatentitet";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Användarbild till Netscape-certifikat";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape-SSL-servernamn";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape-certifikatkommentar";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape-datatyp";
"06 09 60 86 48 01 86 F8 42 02 01"	= "bild/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "bild/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape-certifikatordning";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL till Netscape-certifikat";

"06 08 60 86 48 01 86 F8 42 03"			= "Objektidentifierare för Netscape-katalog";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP-definitioner";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Billicens";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Avdelningsnummer";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Anställningsnummer";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Anställningstyp";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Intranetorganisationsperson";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Kryptografi för serverportar";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Okänt Verisign VPN-tillägg";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Okänt Verisign VPN-tillägg";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign-policyidentifierare";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1-meddelande";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Innehållstyp";
"06 04 67 2A 00 00"	= "PAN-data";
"06 04 67 2A 00 01"	= "PAN-kännetecken";
"06 04 67 2A 00 02"	= "Endast PAN";

"06 03 67 2A 01"	= "Meddelandetillägg";
"06 03 67 2A 02"	= "Fält";
"06 04 67 2A 02 00"	= "Fullständigt namn";
"06 04 67 2A 02 01"	= "Förnamn";
"06 04 67 2A 02 02"	= "Efternamn";
"06 04 67 2A 02 03"	= "Efternamn vid födseln";
"06 04 67 2A 02 04"	= "Platsnamn";
"06 04 67 2A 02 05"	= "ID-nummer";
"06 04 67 2A 02 06"	= "Månad";
"06 04 67 2A 02 07"	= "Datum";
"06 04 67 2A 02 08"	= "Adress";
"06 04 67 2A 02 09"	= "Telefon";
"06 04 67 2A 02 0A"	= "Belopp";
"06 04 67 2A 02 0B"	= "Kontonummer";
"06 04 67 2A 02 0C"	= "Lösenfras";

"06 03 67 2A 03"		= "Attribut";
"06 04 67 2A 03 00"		= "Certifikat";
"06 05 67 2A 03 00 00"	= "Tumavtryck för rotnyckel";
"06 05 67 2A 03 00 01"	= "Extra policy";

"06 03 67 2A 04"	= "Algoritm";
"06 03 67 2A 05"	= "Policy";
"06 04 67 2A 05 00"	= "Rot";
"06 03 67 2A 06"	= "Modul";
"06 03 67 2A 07"	= "Certifikattillägg";
"06 04 67 2A 07 00"	= "Hash-rotnyckel";
"06 04 67 2A 07 01"	= "Certifikattyp";
"06 04 67 2A 07 02"	= "Information om handlare";
"06 04 67 2A 07 03"	= "Kontokortscertifikat krävs";
"06 04 67 2A 07 04"	= "Tunnel";
"06 04 67 2A 07 05"	= "SET-tillägg";
"06 04 67 2A 07 06"	= "SET-kvalificerare";

"06 03 67 2A 08"	= "Märke";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Leverantör";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Anförtro";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Nationell";
"06 05 67 2A 0A E2 00"	= "Japan";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Hash-rotnyckel";
"06 04 86 8D 6F 03"	= "Certifikattyp";
"06 04 86 8D 6F 04"	= "Information om handlare";
"06 04 86 8D 6F 05"	= "Kontokortscertifikat krävs";
"06 04 86 8D 6F 06"	= "Tunnel";
"06 04 86 8D 6F 07"	= "SET-kvalificerare";
"06 04 86 8D 6F 63"	= "SET-data";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple-datasäkerhet";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple pålitlighetspolicyidentifierare";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign-policy";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple X.509 grundläggande policy";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple SSL-policy";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple lokal certifikatgenereringspolicy";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple lokal CSR-genereringspolicy";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple CRL-återkallandepolicy";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple OCSP-återkallandepolicy";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple S/MIME-policy";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple förlängbar autentiseringspolicy";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apples policy för programuppdateringssignering";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPsec-policy";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat-policy";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apples resurssigneringspolicy";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apples Kerberos-klientpolicy";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apples Kerberos-serverpolicy";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apples kodsigneringspolicy";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apples paketsigneringspolicy";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple-säkerhetsalgoritmsidentifierare";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "FEE (Fast Elliptic Encryption)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "ASC (Apple Secure Compression)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE med MD5-signatur";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE med SHA-1-signatur";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED-kryptering";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (experimentell)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE med ECDSA-signatur";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac-certifikatidentifierare";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac-certifikatförfrågan";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac-begäran om ID-certifikat";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac-begäran om e-postsigneringscertifikat";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac-begäran om e-postkrypteringscertifikat";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac-arkivlisteförfrågan";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac-arkivlagerförfrågan";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac-arkivhämtningsförfrågan";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac-arkivborttagningsförfrågan";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac-certifikatförlängning";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac-identitet";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac e-postsignering";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac e-postkryptering";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Värde för Apple .Mac-certifikatförfrågan";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Användarnamn";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Lösenord";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Värdnamn";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Förnya flagga";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Asynkron flagga";

"06 08 2A 86 48 86 F7 63 64 04" = "Apple utökad nyckelanvändning";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple-kodsignering";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple-kodsignering (utveckling)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apples programuppdateringssignering";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple-kodsignering (reserverad)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple resurssignering";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat-signering";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat-kryptering";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple systemidentitet";

"06 08 2A 86 48 86 F7 63 64 05" = "Apples certifikatpolicyer";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apples certifikatpolicy";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac-certifikatpolicy";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Kodsignering";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA Security";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA Security-format";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3-certifikattillägg";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Privata X.509v3-certifikattillägg";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Ämnets signaturbitmap";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Ämnesbild";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Ämnets e-postadress";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Använd undantag";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA Security-algoritmer";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 med ECDSA";

/* end */
